const chars = [
  "𐑐", "𐑑", "𐑒", "𐑓", "𐑔", "𐑕", "𐑖", "𐑗",
  "𐑘", "𐑙", "𐑚", "𐑛", "𐑜", "𐑝", "𐑞", "𐑟",
  "𐑠", "𐑡", "𐑢", "𐑣", "𐑤", "𐑥", "𐑦", "𐑧",
  "𐑨", "𐑩", "𐑪", "𐑫", "𐑬", "𐑭", "𐑮", "𐑯",
  "𐑰", "𐑱", "𐑲", "𐑳", "𐑴", "𐑵", "𐑶", "𐑷",
  "𐑸", "𐑹", "𐑺", "𐑻", "𐑼", "𐑽", "𐑾", "𐑿",
  "-", "·", "⸰",
  
  // + 3 digraphs
  "𐑩𐑯",
  "𐑦𐑙",
  // "𐑕𐑑",
  "𐑩𐑤", // doesn't exist as a compound
  /*
    "𐑤𐑦", // ?
    // "𐑑𐑦",
    "𐑦𐑯", // ?
    "𐑯𐑑", // ?
    // "𐑮𐑦",
    "𐑦𐑕",
    "𐑛𐑦", // ?
    // "𐑦𐑒",
    // "𐑑𐑩",
    "𐑑𐑕", // ?
    // "𐑩𐑕",
    // "𐑯𐑛",
    "𐑖𐑩",
    // "𐑕𐑦", but plausible
    "𐑑𐑮", // ?
    "𐑒𐑩",
    "𐑦𐑑", // ?
    // "𐑯𐑟",
    // "𐑑𐑼",
    "𐑱𐑑", // ?
    "𐑩𐑟",
    // "𐑲𐑟",
    // "𐑧𐑯",
    "𐑒𐑕",
    // "𐑼𐑟",
    "𐑯𐑕",
    "𐑯𐑦", // ?
    "𐑩𐑛",
    // "𐑕𐑩",
    "𐑨𐑯",
  */
  
  // + 5 trigraphs
  "𐑖𐑩𐑯",
  /*
    // "𐑱𐑖𐑩",
    "𐑩𐑯𐑑",
    "𐑑𐑦𐑙",
    "𐑑𐑩𐑛",
    // "𐑦𐑕𐑑",
    // "𐑩𐑯𐑟",
    "𐑒𐑩𐑯",
    // "𐑚𐑩𐑤",
    // "𐑛𐑦𐑕", // ?
  */
];

const toIndex = {};

for (let i in chars) {
  toIndex[chars[i]] = i;
}

export { chars, toIndex };